Revit 2024 API
FabricationPart.ServiceId Property
 The fabrication part service identifier. The service can only be changed to compatible services.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016 Subscription Release
Syntax
C#
public int ServiceId { get; set; }
Visual Basic
Public Property ServiceId As Integer
	Get
	Set
Visual C++
public:
property int ServiceId {
	int get ();
	void set (int value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property:
See Also
FabricationPart Class
Autodesk.Revit.DB Namespace